---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GutterProfileParam
source: html/31c31261-fdd9-9295-4ba5-122dfc1fcd02.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GutterProfileParam Property

"Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId GutterProfileParam { get; }
```